In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

. Data Checks to perform

Check Missing values
Check Duplicates
Check data type
Check the number of unique values of each column
Check statistics of data set
Check various categories present in the different categorical column

In [3]:
df = pd.read_csv("stud.csv")

In [4]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
 8   total_score                  1000 non-null   int64
 9   average_score                1000 non-null   float64
dtypes: float64(1), int64(4), object(5)
memory usage: 78.2+ KB

In [12]:
df["total_score"] = df["math_score"] + df["reading_score"] + df["writing_score"]

In [13]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [15]:
df["average_score"] = (df["math_score"] + df["reading_score"] + df["writing_score"])/3

df.shape

In [ ]:
# Checking Missing values

In [22]:
df.isna().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
total_score                    0
average_score                  0
dtype: int64

In [26]:
df.duplicated().sum()  #checking duplicate values

0

0 duplicate values And 0 missing values
Total 10 columns 5 of object and 5 of numerical

In [48]:
# gives number of unique values 
df.nunique()

gender                           2
race_ethnicity                   5
parental_level_of_education      6
lunch                            2
test_preparation_course          2
math_score                      81
reading_score                   72
writing_score                   77
total_score                    194
average_score                  194
dtype: int64

gender = 2 -- male female
race_ethinicity -- 5  A< B< C< D< E
test_preparation_course --- leads to good marks above 75 aprrox

In [39]:
df.head(20)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333
5,female,group B,associate's degree,standard,none,71,83,78,232,77.333333
6,female,group B,some college,standard,completed,88,95,92,275,91.666667
7,male,group B,some college,free/reduced,none,40,43,39,122,40.666667
8,male,group D,high school,free/reduced,completed,64,64,67,195,65.000000
9,female,group B,high school,free/reduced,none,38,60,50,148,49.333333
10,male,group C,associate's degree,standard,none,58,54,52,164,54.666667
11,male,group D,associate's degree,standard,none,40,52,43,135,45.000000
12,female,group B,high school,standard,none,65,81,73,219,73.000000
13,male,group A,some college,standard,completed,78,72,70,220,73.333333
14,female,group A,master's degree,standard,none,50,53,58,161,53.666667
15,female,group C,some high school,standard,none,69,75,78,222,74.000000
16,male,group C,high school,standard,none,88,89,86,263,87.666667
17,female,group B,some high school,free/reduced,none,18,32,28,78,26.000000
18,male,group C,master's degree,free/reduced,completed,46,42,46,134,44.666667
19,female,group C,associate's degree,free/reduced,none,54,58,61,173,57.666667

In [41]:
df.describe()

       math_score  reading_score  writing_score  total_score  average_score
count  1000.00000    1000.000000    1000.000000  1000.000000    1000.000000
mean     66.08900      69.169000      68.054000   203.312000      67.770667
std      15.16308      14.600192      15.195657    42.771978      14.257326
min       0.00000      17.000000      10.000000    27.000000       9.000000
25%      57.00000      59.000000      57.750000   175.000000      58.333333
50%      66.00000      70.000000      69.000000   205.000000      68.333333
75%      77.00000      79.000000      79.000000   233.000000      77.666667
max     100.00000     100.000000     100.000000   300.000000     100.000000

In [50]:
print("categories present in the categorical column " , end = " ")
print(df["gender"].unique())

print("categories present in the categorical column ",end= " ")
print(df["race_ethnicity"].unique())

print("categories present in the categorical column ",end= " ")
print(df['parental_level_of_education'].unique())

print("categories present in the categorical column ",end= " ")
print(df["lunch"].unique())

print("categories present in the categorical column ",end= " ")
print(df["test_preparation_course"].unique())

categories present in the categorical column  ['female' 'male']
categories present in the categorical column  ['group B' 'group C' 'group A' 'group D' 'group E']
categories present in the categorical column  ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
categories present in the categorical column  ['standard' 'free/reduced']
categories present in the categorical column  ['none' 'completed']

In [57]:
full_marks_math = df[df["math_score"]==100].shape[0]

In [58]:
full_marks_math

7

In [59]:
full_marks_reading = df[df["reading_score"]==100].shape[0]

In [60]:
full_marks_reading

17

In [67]:
full_marks_writing = df[df["writing_score"]==100].shape[0]

In [68]:
full_marks_writing

14

In [71]:
full_marks_all = df[(df["math_score"]==100) &
                    (df["reading_score"]==100) &
                    (df["writing_score"]==100)
]

In [72]:
full_marks_all

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score
458,female,group E,bachelor's degree,standard,none,100,100,100,300,100.0
916,male,group E,bachelor's degree,standard,completed,100,100,100,300,100.0
962,female,group E,associate's degree,standard,none,100,100,100,300,100.0

In [74]:
#Students who fails
fail_math = df[df["math_score"]<=35].shape[0]

In [75]:
fail_math

27

In [77]:
fail_reading= df[df["reading_score"]<=35].shape[0]
fail_reading

15

In [78]:
fail_writing = df[df["writing_score"]<=35].shape[0]
fail_writing

18

In [79]:
# Total fail students
total_fail = df[
(df["math_score"]<=35)&
(df["reading_score"]<=35)&
(df["writing_score"]<=35)
]

In [80]:
total_fail

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score
17,female,group B,some high school,free/reduced,none,18,32,28,78,26.000000
59,female,group C,some high school,free/reduced,none,0,17,10,27,9.000000
76,male,group E,some high school,standard,none,30,26,22,78,26.000000
211,male,group C,some college,free/reduced,none,35,28,27,90,30.000000
327,male,group A,some college,free/reduced,none,28,23,19,70,23.333333
363,female,group D,some high school,free/reduced,none,27,34,32,93,31.000000
596,male,group B,high school,free/reduced,none,30,24,15,69,23.000000
601,female,group C,high school,standard,none,29,29,30,88,29.333333
980,female,group B,high school,free/reduced,none,8,24,23,55,18.333333